netify-soap/src/test/resources/soap/requests/movie/UpdateMovieAddCastRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general" xmlns:role="http://duo.nl/namespace/netify/datatypes/role" xmlns:act="http://duo.nl/namespace/netify/datatypes/actor">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:UpdateMovieAddCastRequest>
            <gen:movieId>11</gen:movieId>
            <gen:cast>
                <role:role>
                    <role:character>Captain kirk</role:character>
                    <role:order>99</role:order>
                    <role:actor>
                        <act:name>Patrick Stewart</act:name>
                        <act:gender>MALE</act:gender>
                    </role:actor>
                </role:role>
            </gen:cast>
        </gen:UpdateMovieAddCastRequest>
    </soapenv:Body>
</soapenv:Envelope>